# Импорт функции получения случайных чисел
# из модуля random.
import random

# Получаем случайное число в диапазоне от 1 до 100.
number = random.randint(1, 101)
print('Угадайте число от 1 до 101')

while True:
    # Получаем число от пользователя и сохраняем его в переменную.
    guess = int(input('Введите число: '))

    # Если число меньше загаданного...
    if guess < number:
        # ...выводим сообщение.
        print('Ваше число меньше того, что загадано.')
    elif guess > number:
        # ...выводим сообщение.
        print('Ваше число больше того, что загадано.')
    elif guess == number:
        # ...прерываем выполнение программы и...
        break
# ...выводим сообщение.
print('Отличная интуиция! Вы угадали число :)')
